# Assignment 6 - Loading Data with Pandas

In this assignment, you will practice loading data into your python environment. It is
recommended that you use either google colab or juypter notebook, however, you may
use any environment you prefer as long as you are using the pandas library.
From the following link, choose two files to answer the questions below.
https://github.com/data602sps/datasetspractice
In addition, you will also search the internet to find two datasets to answer the
questions below.
Websites to find data:
● https://opendata.cityofnewyork.us/
● https://datasetsearch.research.google.com/
● https://www.kaggle.com/datasets
● http://archive.ics.uci.edu/ml/index.php
● https://data.gov/

In [36]:
import pandas as pd

# Question 1
1. Load your dataset into python using the pandas library and save data into a
dataframe named dfi (where i is one of your datasets, for a total of 4)

In [37]:
df_weather = pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/weather.csv")
df_salary = pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/salarydata.csv")
df_atu_dirty = pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/atu_dirty.csv")
df_nba = pd.read_csv("https://raw.githubusercontent.com/data602sps/datasetspractice/main/nba.csv")

# Question 2
Preview your data by calling your dataframe’s name. How many columns and rows
do you see?

In [38]:
df_nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
df_salary.head()

                   Sate  2018 Mean Annual Wage  Unnamed: 2
0               Alabama                 90,620         NaN
1                 Alaska                99,180         NaN
2                Arizona                88,800         NaN
3               Arkansas                81,430         NaN
4             California                97,110         NaN
5               Colorado                82,560         NaN
6            Connecticut                96,010         NaN
7               Delaware                93,880         NaN
8   District of Columbia                89,880         NaN
9                Florida                87,410         NaN
10               Georgia                86,320         NaN
11                Hawaii                90,540         NaN
12                 Idaho                77,700         NaN
13              IIIinois                90,690         NaN
14               lndiana                83,680         NaN
15                  lowa                82,960         NaN
16                Kansas                85,250         NaN
17              Kentucky                84,630         NaN
18             Louisiana                89,860         NaN
19                 Maine                79,910         NaN
20              Maryland                85,170         NaN
21         Massachusetts                91,750         NaN
22              Michigan                91,160         NaN
23             Minnesota                83,750         NaN
24           Mississippi                89,720         NaN
25              Missouri                81,330         NaN
26               Montana                79,050         NaN
27              Nedraska                80,130         NaN
28                Nevada               107,920         NaN
29         New Hampshire                82,880         NaN
30            New Jersey                97,770         NaN
31           New  Mexico                97,210         NaN
32              New York                87,470         NaN
33        North Carolina                87,560         NaN
34          North Dakota                78,120         NaN
35                  Ohio                86,690         NaN
36              Okahoma                 84,860         NaN
37                Oregon                85,890         NaN
38          Pennsylvania                87,050         NaN
39          Rhode Island                83,850         NaN
40        South Carolina                85,450         NaN
41          South Dakota                92,940         NaN
42             Tennessee                85,940         NaN
43                 Taxas                92,940         NaN
44                  Utah                85,940         NaN
45               Vermont                75,010         NaN
46              Virginia                91,700         NaN
47            Washington                85,930         NaN
48         West Virginia                89,420         NaN
49             Wisconsin                85,200         NaN
50               Wyomimg                87,510         NaN

In [40]:
df_atu_dirty.head()

       Unnamed: 0          caseid  V1  V2         V3  V4   V5  V6   V7
0               1  20160101160045  62   2  No answer   1  690   0  465
1               2  20160101160066  69   1  No answer   2  600   0  560
2               3  20160101160069  24   2  No answer   1  940   0   20
3               4  20160101160083  31   2  Part time   1  635   0  120
4               5  20160101160084  59   2  Part time   1  500   0  177
...           ...             ...  ..  ..        ...  ..  ...  ..  ...
10488       10489  20161212162307  52   2  No answer   1  520   0  585
10489       10490  20161212162357  69   1  No answer   1  645   0  625
10490       10491  20161212162426  28   1  Full time   1  402   0   20
10491       10492  20161212162456  80   2  No answer   2  420   0  979
10492       10493  20161212162509  16   2  No answer   1  910   0  430

[10493 rows x 9 columns]

In [41]:
df_weather.head()

,Unnamed: 0,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib
0,1,EWR,2013,1.0,1.0,0.0,37.04,21.92,53.97,230.0,10.35702,11.918651,0.0,1013.9,10.0
1,2,EWR,2013,1.0,1.0,1.0,37.04,21.92,53.97,230.0,13.80936,15.891535,0.0,1013.0,10.0
2,3,EWR,2013,1.0,1.0,2.0,37.94,21.92,52.09,230.0,12.65858,14.567241,0.0,1012.6,10.0
3,4,EWR,2013,1.0,1.0,3.0,37.94,23.00,54.51,230.0,13.80936,15.891535,0.0,1012.7,10.0
4,5,EWR,2013,1.0,1.0,4.0,37.94,24.08,57.04,240.0,14.96014,17.215830,0.0,1012.8,10.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8714,8715,JFK,2013,9.0,2.0,20.0,75.20,73.40,94.14,200.0,4.60312,5.297178,0.0,NaN,4.0
8715,8716,JFK,2013,10.0,23.0,10.0,48.92,39.02,68.51,60.0,4.60312,5.297178,0.0,1008.1,10.0
8716,8717,JFK,2013,10.0,23.0,11.0,48.92,39.02,68.51,40.0,4.60312,5.297178,0.0,1008.5,10.0
8717,8718,JFK,2013,12.0,17.0,5.0,26.96,10.94,50.34,40.0,4.60312,5.297178,0.0,1023.9,10.0
8718,8719,LGA,2013,8.0,22.0,22.0,75.92,66.92,73.68,210.0,8.05546,9.270062,0.0,1011.9,10.0

# Question 3
Examine the shape of your data using the .shape command and the data types of
your columns using .dtypes.

In [42]:
df_dict  = {'df_nba': df_nba, 'df_salary': df_salary, 'df_atu_dirty': df_atu_dirty, 'df_weather': df_weather}
for df_name, df in df_dict.items():
    print("\n+++++++++++++++++++++++++++++++++++++++++++++ ")
    print("Dataframe: ", df_name)
    print("The shape of dataframe ", df.shape)
    print("The data type of columns ", df.dtypes)

+++++++++++++++++++++++++++++++++++++++++++++
Dataframe:  df_nba
The shape of dataframe  (458, 9)
The data type of columns  Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

+++++++++++++++++++++++++++++++++++++++++++++
Dataframe:  df_salary
The shape of dataframe  (51, 3)
The data type of columns  Sate                      object
2018 Mean Annual Wage     object
Unnamed: 2               float64
dtype: object

+++++++++++++++++++++++++++++++++++++++++++++
Dataframe:  df_atu_dirty
The shape of dataframe  (10493, 9)
The data type of columns  Unnamed: 0     int64
caseid         int64
V1             int64
V2             int64
V3            object
V4             int64
V5             int64
V6             int64
V7             int64
dtype: object

+++++++++++++++++++++++++++++++++++++++++++++
Dataframe:  df_weather
The shape of dataframe  (8719, 15)
The data type of columns  Unnamed: 0      int64
origin         object
year            int64
month         float64
day           float64
hour          float64
temp          float64
dewp          float64
humid         float64
wind_dir      float64
wind_speed    float64
wind_gust     float64
precip        float64
pressure      float64
visib         float64
dtype: object

# Question 4
Use .describe() on your data. What do you notice about your data? What does this
command return?

.describe() returns the summary statistics of a given data frame.

In [43]:
for df_name, df in df_dict.items():
    print("\n +++++++++++++++++++++++++++++++++++++++++++++ \n")
    print("Dataframe: ", df_name)
    print(df.describe())

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_nba
           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_salary
       Unnamed: 2
count         0.0
mean          NaN
std           NaN
min           NaN
25%           NaN
50%           NaN
75%           NaN
max           NaN

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_atu_dirty
         Unnamed: 0        caseid            V1            V2            V4  \
count  10493.000000  1.049300e+04  10493.000000  10493.000000  10493.000000
mean    5247.000000  2.016063e+13     49.418565      1.554941      1.124369
std     3029.212521  3.486162e+08     18.112827      0.496996      0.330017
min        1.000000  2.016010e+13     15.000000      1.000000      1.000000
25%     2624.000000  2.016030e+13     35.000000      1.000000      1.000000
50%     5247.000000  2.016061e+13     49.000000      2.000000      1.000000
75%     7870.000000  2.016091e+13     64.000000      2.000000      1.000000
max    10493.000000  2.016121e+13     85.000000      2.000000      2.000000

                 V5            V6            V7
count  10493.000000  10493.000000  10493.000000
mean     534.614791      7.046507    298.430477
std      137.164066     45.883855    213.629890
min        0.000000      0.000000      0.000000
25%      450.000000      0.000000    130.000000
50%      525.000000      0.000000    260.000000
75%      600.000000      0.000000    432.000000
max     1428.000000    980.000000   1392.000000

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_weather
        Unnamed: 0    year        month          day         hour  \
count  8719.000000  8719.0  8718.000000  8718.000000  8718.000000
mean   4360.000000  2013.0     6.506538    15.679628    11.515715
std    2517.102832     0.0     3.439961     8.768250     6.916846
min       1.000000  2013.0     1.000000     1.000000     0.000000
25%    2180.500000  2013.0     4.000000     8.000000     6.000000
50%    4360.000000  2013.0     7.000000    16.000000    12.000000
75%    6539.500000  2013.0     9.000000    23.000000    18.000000
max    8719.000000  2013.0    12.000000    31.000000    23.000000

              temp         dewp        humid     wind_dir   wind_speed  \
count  8718.000000  8718.000000  8718.000000  8486.000000  8718.000000
mean     55.484942    41.794184    62.863333   193.194674     9.335732
std      18.345817    19.619776    19.572699   110.541333    12.328261
min      10.940000    -9.040000    13.950000     0.000000     0.000000
25%      39.920000    26.060000    47.602500   110.000000     5.753900
50%      55.940000    42.800000    62.330000   220.000000     9.206240
75%      71.060000    57.920000    78.790000   280.000000    12.658580
max     100.040000    75.920000   100.000000   360.000000  1048.360580

         wind_gust       precip     pressure        visib
count  8718.000000  8719.000000  7780.000000  8719.000000
mean     10.743374     0.003035  1017.826465     9.224522
std      14.187117     0.022686     7.396722     2.094044
min       0.000000     0.000000   983.900000     0.120000
25%       6.621473     0.000000  1012.800000    10.000000
50%      10.594357     0.000000  1017.500000    10.000000
75%      14.567241     0.000000  1022.900000    10.000000
max    1206.432388     1.180000  1041.900000    10.000000

# Question 5
Use the .head() and .tail() command - what does this do?

In [44]:
for df_name, df in df_dict.items():
    print("\n +++++++++++++++++++++++++++++++++++++++++++++ \n")
    print("Dataframe: ", df_name)
    print(df.head())
    print(df.tail())

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_nba
            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0
             Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_salary
        Sate  2018 Mean Annual Wage  Unnamed: 2
0    Alabama                 90,620         NaN
1      Alaska                99,180         NaN
2     Arizona                88,800         NaN
3    Arkansas                81,430         NaN
4  California                97,110         NaN
            Sate  2018 Mean Annual Wage  Unnamed: 2
46       Virginia                91,700         NaN
47     Washington                85,930         NaN
48  West Virginia                89,420         NaN
49      Wisconsin                85,200         NaN
50        Wyomimg                87,510         NaN

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_atu_dirty
   Unnamed: 0          caseid  V1  V2         V3  V4   V5  V6   V7
0           1  20160101160045  62   2  No answer   1  690   0  465
1           2  20160101160066  69   1  No answer   2  600   0  560
2           3  20160101160069  24   2  No answer   1  940   0   20
3           4  20160101160083  31   2  Part time   1  635   0  120
4           5  20160101160084  59   2  Part time   1  500   0  177
       Unnamed: 0          caseid  V1  V2         V3  V4   V5  V6   V7
10488       10489  20161212162307  52   2  No answer   1  520   0  585
10489       10490  20161212162357  69   1  No answer   1  645   0  625
10490       10491  20161212162426  28   1  Full time   1  402   0   20
10491       10492  20161212162456  80   2  No answer   2  420   0  979
10492       10493  20161212162509  16   2  No answer   1  910   0  430

 +++++++++++++++++++++++++++++++++++++++++++++

Dataframe:  df_weather
   Unnamed: 0 origin  year  month  day  hour   temp   dewp  humid  wind_dir  \
0           1    EWR  2013    1.0  1.0   0.0  37.04  21.92  53.97     230.0
1           2    EWR  2013    1.0  1.0   1.0  37.04  21.92  53.97     230.0
2           3    EWR  2013    1.0  1.0   2.0  37.94  21.92  52.09     230.0
3           4    EWR  2013    1.0  1.0   3.0  37.94  23.00  54.51     230.0
4           5    EWR  2013    1.0  1.0   4.0  37.94  24.08  57.04     240.0

   wind_speed  wind_gust  precip  pressure  visib
0    10.35702  11.918651     0.0    1013.9   10.0
1    13.80936  15.891535     0.0    1013.0   10.0
2    12.65858  14.567241     0.0    1012.6   10.0
3    13.80936  15.891535     0.0    1012.7   10.0
4    14.96014  17.215830     0.0    1012.8   10.0
      Unnamed: 0 origin  year  month   day  hour   temp   dewp  humid  \
8714        8715    JFK  2013    9.0   2.0  20.0  75.20  73.40  94.14
8715        8716    JFK  2013   10.0  23.0  10.0  48.92  39.02  68.51
8716        8717    JFK  2013   10.0  23.0  11.0  48.92  39.02  68.51
8717        8718    JFK  2013   12.0  17.0   5.0  26.96  10.94  50.34
8718        8719    LGA  2013    8.0  22.0  22.0  75.92  66.92  73.68

      wind_dir  wind_speed  wind_gust  precip  pressure  visib
8714     200.0     4.60312   5.297178     0.0       NaN    4.0
8715      60.0     4.60312   5.297178     0.0    1008.1   10.0
8716      40.0     4.60312   5.297178     0.0    1008.5   10.0
8717      40.0     4.60312   5.297178     0.0    1023.9   10.0
8718     210.0     8.05546   9.270062     0.0    1011.9   10.0

# Extra Credit 1

Link the kaggle site used:
https://www.kaggle.com/datasets/mirzahasnine/heart-disease-dataset
https://github.com/Kaggle/kaggle-api

In [45]:
import kaggle

kaggle.api.authenticate()
kaggle.api.dataset_download_files('mirzahasnine/heart-disease-dataset', path='./', unzip=True)

In [46]:
# do not include header row
heart_data = pd.read_csv("heart_disease.csv", header  = None, skiprows= 1)

In [47]:
heart_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,Male,39,postgraduate,0,0.0,0.0,no,0,0,195.0,106.0,70.0,26.97,80.0,77.0,No
1,Female,46,primaryschool,0,0.0,0.0,no,0,0,250.0,121.0,81.0,28.73,95.0,76.0,No
2,Male,48,uneducated,1,20.0,0.0,no,0,0,245.0,127.5,80.0,25.34,75.0,70.0,No
3,Female,61,graduate,1,30.0,0.0,no,1,0,225.0,150.0,95.0,28.58,65.0,103.0,yes
4,Female,46,graduate,1,23.0,0.0,no,0,0,285.0,130.0,84.0,23.10,85.0,85.0,No

Using pandas, update the dataset to include the header information. Display the
updated data using .head().

In [48]:
column_names = ['Gender',
                'age',
                'education',
                'currentSmoker',
                'cigsPerDay',
                'BPMeds',
                'prevalentStroke',
                'prevalentHyp',
                'diabetes',
                'totChol',
                'sysBP',
                'diaBP',
                'BMI',
                'heartRate',
                'glucose',
                'Heart_ stroke']

In [49]:
heart_data.columns = column_names

In [50]:
heart_data.head()

,Gender,age,education,currentSmoker,cigsPerDay,BPMeds,prevalentStroke,prevalentHyp,diabetes,totChol,sysBP,diaBP,BMI,heartRate,glucose,Heart_ stroke
0,Male,39,postgraduate,0,0.0,0.0,no,0,0,195.0,106.0,70.0,26.97,80.0,77.0,No
1,Female,46,primaryschool,0,0.0,0.0,no,0,0,250.0,121.0,81.0,28.73,95.0,76.0,No
2,Male,48,uneducated,1,20.0,0.0,no,0,0,245.0,127.5,80.0,25.34,75.0,70.0,No
3,Female,61,graduate,1,30.0,0.0,no,1,0,225.0,150.0,95.0,28.58,65.0,103.0,yes
4,Female,46,graduate,1,23.0,0.0,no,0,0,285.0,130.0,84.0,23.10,85.0,85.0,No

# Extra Credit 2

In [51]:
# import untidy data used for data 607 class, now instead of using R, we will use Python
nba_data = pd.read_csv("https://raw.githubusercontent.com/Nick-Climaco/Rdataset/main/nba_players.csv")

In [52]:
nba_data.head()

,1,2,3,4,5
0,Nikola Jokic,Team: DEN,Position: BIG,Age: 28,Points: 24.5
1,NaN,Field goals made: 9.3,Field goal percentage: 63.2,3-pointers made: 0.8,3-pointer percentage: 40.2
2,NaN,Free throw attempts: 6.1,Free throw percentage: 82.6,Offensive rebounds: 2.2,Defensive rebounds: 9.4
3,NaN,Assists: 10.0,Turnovers: 3.6,Steals: 1.3,Blocks: 0.7
4,Giannis Antetokounmpo,Team: MIL,Position: BIG,Age: 28,Points: 31.3

In [53]:
# .melt() similar to pivot_longer() in R
nba_tidy = pd.melt(nba_data, id_vars=["1"], value_vars=["2", "3", "4", "5"], var_name="old_colnames", value_name="value")

# separating the statistics and value to two new columns
# tried using str_split(), didnt work.
nba_tidy[["statistics", "measure"]] = nba_tidy["value"].str.split(":", expand = True)

# dropped redundant columns
nba_tidy = nba_tidy.drop(["old_colnames", "value"], axis = 1)

# fill na with player names
nba_tidy["1"] = nba_tidy["1"].fillna(method = "ffill")

# pivot_wider() but in python
nba_tidy = nba_tidy.pivot(index = "1", columns = "statistics", values = "measure")

# sort values for Team then Points
nba_tidy = nba_tidy.sort_values(by = ["Team", "Points"], ascending = [True, False])

# reset the index and rename the colname 1 to Player Name
nba_tidy = nba_tidy.reset_index().rename(columns = {"1" : "Player Name"})

# new order columns
nba_tidy = nba_tidy[['Player Name',
                     'Age',
                     'Team',
                     'Points',
                     'Position',
                     '3-pointer percentage',
                     '3-pointers made',
                     'Assists',
                     'Blocks',
                     'Defensive rebounds',
                     'Field goal percentage',
                     'Field goals made',
                     'Free throw attempts',
                     'Free throw percentage',
                     'Offensive rebounds',
                     'Steals',
                     'Turnovers'
                     ]]

In [54]:
nba_tidy

statistics,Player Name,Age,Team,Points,Position,3-pointer percentage,3-pointers made,Assists,Blocks,Defensive rebounds,Field goal percentage,Field goals made,Free throw attempts,Free throw percentage,Offensive rebounds,Steals,Turnovers
0,Trae Young,24,ATL,26.9,GUARD,32.9,2.2,10.2,0.2,2.2,42.8,8.4,8.8,88.7,0.7,1.0,4.1
1,Dejounte Murray,26,ATL,20.8,GUARD,36.2,2.0,6.1,0.3,4.9,46.5,8.4,2.5,83.7,0.7,1.5,2.3
2,Clint Capela,28,ATL,12.1,BIG,0.0,0.0,0.8,1.2,7.0,62.9,5.5,1.8,61.3,4.2,0.7,0.8
3,Mikal Bridges,26,BKN,17.6,FORWARD,39.6,1.9,3.5,0.8,3.4,46.7,6.4,3.2,89.6,1.1,1.2,1.5
4,Spencer Dinwiddie,29,BKN,17.5,GUARD,39.6,2.5,5.3,0.3,2.8,44.8,5.8,4.0,82.5,0.3,0.8,1.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,Lauri Markkanen,25,UTA,25.2,BIG,40.9,3.0,1.8,0.6,6.7,51.4,8.5,5.8,88.3,1.8,0.6,1.9
96,Jordan Clarkson,30,UTA,20.9,GUARD,34.1,2.6,4.3,0.2,2.9,44.5,7.5,4.0,81.9,1.2,0.5,3.1
97,Bradley Beal,29,WAS,22.9,GUARD,37.2,1.7,5.2,0.7,2.7,51.8,8.7,4.4,85.7,0.8,0.9,2.8
98,Kristaps Porzingis,27,WAS,22.8,BIG,37.6,2.1,2.5,1.5,6.7,48.7,7.4,7.0,84.6,1.9,0.9,2.2
99,Kyle Kuzma,27,WAS,21.4,FORWARD,33.5,2.6,3.9,0.5,6.6,45.1,8.1,3.6,71.9,0.9,0.5,3.0